{
  "profile": {
    "rol": "Computer Programmer Analyst",
    "description": "I consider myself a creative, sociable and proactive person, with an excellent disposition for teamwork and eager to continue learning. I like to create, design and innovate, my knowledge is oriented to web development. My goal is to become a great Front-End Developer"
  },
  "experience": {
    "experiences": "Experiences",
    "job-title-two": "Front-end Developer",
    "job-dates-two": "January 2022 - May 2023",
    "job-description-two": "Tasks performed: Responsible for transferring designs and layout of websites to clients, developing responsive user interfaces, as well as updating and maintaining the sites.",
    "job-title-one": "Front-end Developer",
    "job-dates-one": "August 2019 - August 2021",
    "job-description-one": "Tasks performed: Responsible for layout, correcting, designing and adding new functionalities to websites oriented to the e-commerce, in addition to solving customer support."
  },
  "hobbies": {
    "hobbies": "Hobbies",
    "title-first-activity": "Travel",
    "description-first-activity": "I love getting to know the world around us, knowing that the world we live in is surrounded by wonderful places waiting to be explored. I like to break the routine and go out to discover new places, people and cultures. These are moments in life that can hardly be forgotten.",
    "title-second-activity": "Play videogames",
    "description-second-activity": "In my opinion, I consider videogames an art, all the work behind their development is incredible, it is creativity in its purest form. Screenwriters, cartoonists, actors, musicians, programmers, etc. Many people working together to deliver unique experiences and sensations to users. In addition, thanks to technology, videogames allow you to play online with people from all over the world and share with them even if they are several kilometers away. Cool no?",
    "title-third-activity": "Draw",
    "description-third-activity": "As a child I like to draw, at first I drew characters from the Dragon Ball Z series, it was an anime of inspiration at that time. I remember making comics, creating characters and stories. Over time I began to try other types of drawings, landscapes, graffiti, portraits and much more. I always made an effort to improve every day, and today I am happy with the results obtained. As an adult, free time is scarcer, it is difficult to find a moment to take a paper and a pencil to start creating. But as difficult as it may be, there is always a time to enjoy the things we like to do."
  },
  "skills": {
    "skills-title": "Skills",
    "skills-subtitle": "Years of experience"
  },
  "projects": {
    "description-pokeapi-1": "This project allows the user to search for information about the famous creatures known as Pokémon in a different, attractive and fun way.The development of this project arises to put into practice my knowledge in Html, Css, JavasScript. The main objective is to interact, through AJAX, with the external POKÉMON API, to obtain the information it gives us and thus be able to render it on the screen",
    "description-pokeapi-2": "To go further, I wanted to imitate the features of the original pokedex, to achieve this, add extra features such as an on and off button, sound effects, animations and error control to improve the experience. Finally look for a way that the pokedex will not only show the information on the screen, but also, that it will speak. I achieved that through interaction with the web API known as 'SpeechSynthesis'.",
    "description-jumping-1": "I have always been interested in video game development, it is for this reason that I took a basic unity course to enter this wonderful world, it is completely fun to create something from scratch and then see the final result. Choosing the sprites (characters), giving them movement, adding music and sound effects, delivering a playable experience no matter how simple it is is great.",
    "description-jumping-2": "Jumping is a 2D pixelar style video game, and consists of jumping enemies to accumulate points. The more you advance the difficulty goes up which causes the enemies to advance faster, you lose in the game when you collide with one of the enemies.",
    "description-jumping-3": "Jumping developed it as the final project of the course, in 2018. When I was studying my career as a programmer, this helped me to understand and learn more about programming in general.",
    "description-crazy-ball-1": "This is the second video game I develop, the gameplay and purpose of this game is quite simple. the idea of this project came up to learn to work with the planes 'X, Y, Z (Width, Height, Depth)' to develop a video game in 3 Dimensions (3D), in addition to continuing to learn programming.",
    "description-crazy-ball-2": "Crazy ball consiste to touch the yellow squares to accumulate score with the ball that is manipulated through keyboard events to give direction.",
    "description-crazy-ball-3": "This video game was developed in 2018, after finishing my first video game that same year.",
    "title-digital-curriculum": "Digital Curriculum",
    "description-digital-curriculum-1": "I was looking to have something interesting to lay out and thus be able to practice my knowledge in CSS Grid and responsive web design, that's where the idea came to transform my CV in PDF format, to something completely digital. This would serve as an exercise to work with a grid system and make a completely responsive site.",
    "description-digital-curriculum-2": "The phone number and email address at the top of the resume header are linked to provide direct contact. Below the personal description, there is a link that will redirect directly to my professional portfolio. Also, add a button that allows the user to change the entire hue of the site to a dark or light mode in order to improve the user experience. Saving this configuration in the local storage of the browser (local storage), in this way, the next time the user visits the site again, it will load the last configuration.",
    "title-popular-movies": "Popular Movies",
    "description-popular-movies-1": "This project was created to continue putting my knowledge into practice, this time I wanted to make a responsive website that had a search engine and pagination. To accomplish this, I worked with consuming The Movie DataBase (TMDB) API.",
    "description-popular-movies-2": "For context, (TMDB) is a movie and TV database created by its community. Every piece of data has been added by the community since 2008..",
    "description-popular-movies-3": "Through this project it is possible to obtain and consult the most popular films today, obtaining relevant information from each of them. All site functionality runs asynchronously in a single HTML file.",
    "title-raffle-draw": "Raffle draw",
    "description-raffle-draw-1": "The idea for this project arises from a particular situation. When I observed a person drawing a raffle online and searched the internet for a random number generator, but many of these programs were very simple and not very stylish. So at that moment it occurred to me to create a different program, something that would not only meet the main needs of a raffle giveaway, but also that would be eye-catching and intuitive with the user.",
    "description-raffle-draw-2": "The program allows the user to enter the number of numbers that will participate in the raffle, in addition to the prizes that will be drawn. Rendering this information on screen so that all participants are aware of the information. It also allows you to obtain winning and losing numbers randomly, which are displayed in different sections of the application. The program also has informative popups that help the user with interaction. All this is done in an interface with a nice design and animations to provide a better user experience.",
    "free-games": "Free Games",
    "description-free-games-1": "This project was born from the idea of building my first application, from scratch, with new knowledge that I have been acquiring, such as REACT JS and what it is like to work with this wonderful technology in practice.",
    "description-free-games-2": "Free Games is a single page application (SPA), that is, it is an application that performs all its functionality on a single page, without the need to reload the browser, we can achieve this thanks to the magnificent way React JS works .",
    "description-free-games-3": "The main function of the application is to consult an API that gives us information about completely free video games. In addition, the application has a gallery of images of some of the most iconic games and characters in the gamer world and you will have the option to download them so that you can leave them as a wallpaper on your phone. Finally you will be able to see a blog with articles related to video games and a section dedicated to my YouTube channel where you can enjoy gameplays and some of the most epic scenes in the gaming world.",
    "patient-manager": "Patient manager",
    "description-patient-manager-1": "This project was born with the intention of practicing the basic knowledge of React JS, such as state management, components, communication between components through props, hooks, conditional rendering, etc.",
    "description-patient-manager-2": "It is a simple application that allows the administration of patients through the basic operations of a CRUD, that is, it allows to Create, Read, Update and Delete patient records in order to be able to manage the information. This app stores the records in the localStorage since it is a Front-End oriented project.",
    "bootstrap-layout": "bootstrap-layout",
    "my-web-site": "My web site",
    "description-bootstrap-layout-1": "Layout made with the aim of practicing my knowledge in this CSS Framework such as Bootstrap, as well as putting into practice the new features that this technology brought in its most recent version, Bootstrap 5.",
    "description-bootstrap-layout-2": "It is a simple layout, where bootstrap's characteristic column system is implemented, allowing the site to be fully responsive. In addition to the use of some of its components such as the navbar and the slider.",
    "description-my-site-web-1": "To continue putting my knowledge in React JS into practice, I wanted to develop this project, which consists of creating my own web page.",
    "description-my-site-web-2": "The main objective of this application is that you can find personal information and know a little more about me. You can find personal, professional and contact information.",
    "description-my-site-web-3": "The application has a welcome page which will allow you to later enter the main content, which is divided into three sections. Personal, professional and contact, which you can access through a side menu. You will have the option of being able to listen to background music to take your experience to the limit if you wish, that type of music is what I listened to to motivate me and be able to carry out this project.",
    "description-my-site-web-4": "Have a good experience!!",
    "rick&morty-app": "Rick and Morty challenge",
    "description-r&m-1": "This project was born from the development of a test to apply for a position as a front-end developer.",
    "description-r&m-2": "The challenge is to develop an application with React JS as the main technology.",
    "description-r&m-3": "The points described below are some of the most important requirements requested in the test and that the application should have.",
    "item-1": "Have a main layout that nests the views.",
    "item-2": "It has to be responsive.",
    "item-3": "It must contain a navigation menu to the views.",
    "item-4": "You must get the data through the Rick and Morty API.",
    "item-5": "It must have pagination. (optional)",
    "item-6": "It must contain a search engine that filters the results.",
    "item-7": "Clicking on a result should open a modal with details of what is selected.",
    "item-8": "The results must be able to be added to favorites.",
    "item-9": "The data should persist when reloading the page.",
    "item-10": "Good design. (optional)"
  },
  "buttons": {
    "code-button": "code"
  }
}
