{
  "profile": {
    "rol": "Analista Programador Computacional",
    "description": "Me considero una persona creativa, sociable y proactiva, con excelente disposición para el trabajo en equipo y con muchas ganas de seguir aprendiendo. Me gusta crear, diseñar e innovar, mis conocimientos están orientados al desarrollo web. Mi objetivo es convertirme en un gran Front-End Developer."
  },
  "experience": {
    "experiences": "Experiencias",
    "first-job-title": "Desarrollador Front-end",
    "first-job-dates": "Agosto 2019 - Agosto 2021",
    "first-job-description": "Tareas realizadas: Encargado de maquetar, corregir, diseñar y agregar nuevas funcionalidades a sitios web orientados al e-commerce que se les brindan a los clientes."
  },
  "hobbies": {
    "hobbies": "Pasatiempos",
    "title-first-activity": "Viajar",
    "description-first-activity": "Me encanta salir a conocer el mundo que nos rodea, saber que el mundo en el que vivimos está rodeado de lugares maravillosos esperando a ser explorados. Me gusta romper la rutina y salir a descubrir nuevos parajes, personas y culturas. Son momentos que en la vida, difícilmente se pueden olvidar.",
    "title-second-activity": "Jugar videojuegos",
    "description-second-activity": "En mi opinión considero los videojuegos un arte, es increíble todo el trabajo que hay detrás del desarrollo de los mismos, es creatividad en estado puro. Guionistas, dibujantes, actores, músicos, programadores, etc. Muchas personas trabajando en conjunto para entregar experiencias y sensaciones únicas a los usuarios. Además, Gracias a la tecnología los videojuegos te permiten jugar de manera online con personas de todas partes del mundo y compartir con ellos aunque estén a varios kilómetros de distancia. ¿Genial no?",
    "title-third-activity": "Dibujar",
    "description-third-activity": "De pequeño que me gusta dibujar, en un comienzo dibujaba personajes de la serie Dragon Ball Z, fue un anime de inspiración en ese entonces. Recuerdo hacer comics, crear personajes e historias. Con el tiempo empece a probar con otro tipo de dibujos, paisajes, grafitis, retratos y mucho más. Siempre me esforcé para mejorar cada día, y en la actualidad me encuentro feliz por los resultados obtenidos. Ya siendo adulto el tiempo libre es mas escaso, se dificulta encontrar un momento para tomar un papel y un lápiz para ponerse a crear. Pero por difícil que sea siempre hay un momento para disfrutar de las cosas que nos gusta hacer."
  },
  "skills": {
    "skills-title": "Habilidades",
    "skills-subtitle": "Años de experiencia"
  },
  "projects": {
    "description-pokeapi-1": "Este proyecto permite al usuario buscar información de las famosas criaturas conocidas como Pokémon de una manera diferente, atractiva y divertida. El desarrollo de este proyecto surge para poner en práctica mis conocimientos en Html, Css, JavasScript. El objetivo principal es interactuar, a través de AJAX, con la API externa de Pokémon, para obtener la información que esta nos brinda y poder asi renderizarla en pantalla.",
    "description-pokeapi-2": "Para llegar más allá, quise imitar las características de la pokedex original, para conseguirlo, agregue funcionalidades extras como un botón de encendido y apagado, efectos de sonido, animaciones y control de errores para mejorar la experiencia. Finalmente busque la manera que la pokedex no solo mostrara la información por pantalla, sino tambien, que hablara. Eso lo conseguí a través de la interacción con la web API conocida como 'SpeechSynthesis'.",
    "description-jumping-1": "Siempre me ha interesado el desarrollo de videojuegos, es por este motivo que realice un curso básico de unity para adentrarme a este maravilloso mundo, es completamente divertido crear algo desde 0 y después ver el resultado final. Elegir los sprites(personajes), darles movimiento, agregar efectos de música y sonido, entregar una experiencia jugable por mas simple que sea es genial.",
    "description-jumping-2": "Jumping es un videojuego estilo pixelar en 2D, y consiste en ir saltando enemigos para ir acumulando puntos. Entre más avanzas va subiendo la dificultad lo que provoca que los enemigos avancen más rápido, pierdes en el juego cuando colisionas con alguno de los enemigos.",
    "description-jumping-3": "Jumping lo desarrolle como proyecto final del curso, en el año 2018. Cuando estaba cursando mi carrera como programador, esto me sirvió para ir entendiendo y aprender más sobre programación en general.",
    "description-crazy-ball-1": "Este fúe el segundo videojuego que desarrolle, la jugabilidad y la finalidad de este juego es bastante simple. la idea de este proyecto surgió para aprender a trabajar con los planos 'X,Y,Z (Ancho, Alto, Profundidad)' para desarrollar un videojuego en 3 Dimensiones (3D), ademas de seguir aprendiendo programación.",
    "description-crazy-ball-2": "Crazy ball consiste el tocar los cuadrados amarillos para ir acumulando puntaje con la bola que es manipulada a traves de eventos del teclado para darle dirección.",
    "description-crazy-ball-3": "Este videojuego fue desarrollado en el año 2018, después de terminar con mi primer videojuego ese mismo año.",
    "title-digital-curriculum": "Curriculum Digital",
    "description-digital-curriculum-1": "Estaba en la búsqueda de tener algo interesante para maquetar y  así poder practicar mis conocimientos en CSS Grid y Responsive Web Desing, ahí surgió la idea de transformar mi curriculum en formato PDF, a algo completamente digital. Esto me serviría como ejercicio para trabajar con un sistema de cuadrícula y realizar un sitio completamente responsivo.",
    "description-digital-curriculum-2": "El número de teléfono y la dirección de email que se encuentran en la parte superior, en la cabecera del curriculum, están enlazados para brindar un contacto directo. Debajo de la descripción personal, se encuentra un enlace que redirige directo a mi portafolio profesional. Además, agregue un botón que le permite al usuario cambiar la tonalidad completa del sitio a un modo oscuro o luminoso con la finalidad de mejorar la experiencia del usuario. Guardando esta configuración en el almacenamiento local del navegador (local storage), de esta manera,  la próxima vez que el usuario vuelva a visitar al sitio, cargará la última configuración.",
    "title-popular-movies": "Películas Populares",
    "description-popular-movies-1": "Este proyecto fue creado para seguir poniendo en practica mis conocimientos, en esta ocasión quise realizar un sitio web responsivo, que tuviera un buscador y paginación. Para lograr esto, trabajé con el consumo de la API de The Movie DataBase (TMDB).",
    "description-popular-movies-2": "Para entrar en contexto, (TMDB) es una base de datos de películas y TV creada por su comunidad. Cada pieza de dato ha sido agregada por la comunidad desde el año 2008.",
    "description-popular-movies-3": "A través de este proyecto se puede obtener y consultar las películas más populares en la actualidad, obteniendo información relevante de cada una de ellas. Toda la funcionalidad del sitio se ejecuta de manera asíncrona en un solo archivo HTML.",
    "title-raffle-draw": "Sorteo de rifa",
    "description-raffle-draw-1": "La idea de este proyecto surge a raíz de una situación en particular. Cuando observe a una persona sorteando una rifa de manera online y buscaba en internet un generador de número aleatorios, pero muchos de estos programas eran muy simples y poco estilosos. Entonces en ese momento se me ocurrió crear un programa diferente, algo que no solo cumpliera con las necesidades principales de un sorteo de rifa, sino también, que fuera llamativo e intuitivo con el usuario.",
    "description-raffle-draw-2": "El programa le permite al usuario ingresar la cantidad de números que participaran de la rifa, además de los premios que se sortearan. Renderizando esta información en pantalla para que todos los participantes estén al tanto de la información.  También permite obtener números ganadores como perdedores de forma aleatoria, que se van visualizando en  diferentes secciones  en la aplicación. El programa también cuenta con popup informativos que ayudan al usuario con la interacción. Todo esto se realiza en una interfaz con un lindo diseño y animaciones para brindar una mejor experiencia al usuario.",
    "free-games": "Juegos Gratis",
    "description-free-games-1": "Este proyecto nace a partir de la idea de construir mi primera aplicación, desde cero, con nuevos conocimientos que he ido adquiriendo como lo es REACT JS y como es trabajar con esta maravillosa tecnología en la práctica.",
    "description-free-games-2": "Juegos Gratis es una single page application (SPA), es decir, es una aplicación que realiza toda su funcionalidad en una sola página, sin la necesidad de recargar el navegador, esto lo podemos conseguir gracias a la magnifica forma que tiene de trabajar React JS.",
    "description-free-games-3": "La principal función que tiene la aplicación es la de consultar una API que nos brinda información acerca de videojuegos completamente gratuitos. Ademas, la aplicación cuenta con una galería de imágenes de algunos de los juegos y personajes mas iconicos del mundo gamer y tendrás la opción de poder descargarlas para que las puedas dejar como fondo de pantalla en tú teléfono. Finalmente podrás ver un blog con artículos relacionados a los videojuegos y una sección dedicada a mi canal de YouTube donde podrás disfrutar de gameplays y de algunas de las escenas más épicas del mundo gaming.",
    "patient-manager": "Administrador de pacientes",
    "description-patient-manager-1": "Este proyecto nace con la intención de practicar los conocimientos básicos de React JS, como lo es el manejo del estado, componentes, comunicación entre componentes a traves de props, hooks, renderizado condicional, etc.",
    "description-patient-manager-2": "Es una aplicación simple que permite la administración de pacientes a traves de las operaciones básicas de un CRUD, es decir, permite Crear, Leer, Actualizar y Eliminar registros de pacientes con el objetivo de poder administrar la información. Esta app almacena los registro en el localStorage ya que es un proyecto orientado al Front-End.",
    "bootstrap-layout": "Maquetación Bootstrap",
    "description-bootstrap-layout-1": "Maquetación realizada con el objetivo de practicar mis conocimientos en en este Framework de Css como lo es Bootstrap, como tambien poner en practica las nuevas características que trajo está tecnología en su versión mas reciente, Bootstrap 5.",
    "description-bootstrap-layout-2": "Es una maquetación sencilla, donde se implementa el sistema de columnas tan característico de bootstrap permitiendo que el sitio sea completamente responsivo. Ademas de la utilización de algunos de sus componentes como el navbar y el slider."
  }
}
